# config.py

COURSE_CODE_MAPPING = {
    'GR': '共同必修系列', 'CC': '核心通識', 'LI': '博雅通識', 'SC': '博雅通識',
    'SO': '博雅通識', 'CD': '全民國防教育類', 'IN': '興趣選修', 'wl': '西洋語文學系',
    'kh': '運動健康與休閒學系', 'CCD': '工藝與創意設計學系', 'DA': '建築學系',
    'CDA': '創意設計與建築學系', 'EL': '東亞語文學系', 'DAP': '運動競技學系',
    'CHS': '人文社會科學院共同課程', 'la': '法律學系', 'GL': '政治法律學系',
    'fl': '財經法律學系', 'CCL': '法學院共同課程', 'ae': '應用經濟學系', 'FI': '財務金融學系',
    'IM': '資訊管理學系', 'CCM': '管理學院共同課程', 'am': '應用數學系', 'ac': '應用化學系',
    'AP': '應用物理學系', 'CCS': '理學院共同課程', 'ee': '電機工程學系', 'CE': '土木與環境工程學系',
    'CS': '資訊工程學系', 'CM': '化學工程及材料工程學系', 'CCE': '工學院共同課程',
    'ls': '生命科學系', 'AB': '亞太工商管理學系', 'ISP': '國際學生系', 'CPP': '華語先修班',
    'FIN': '財務金融學系(停用)', 'IFD': '創新學院不分系'
}

# 核心通識子分類對應表
CC_SUBCATEGORY_MAPPING = {
    'C5': '科學素養',
    'C6':'倫理素養',
    'I1': '思維方法', 
    'I2': '美學素養',
    'O3': '公民素養',
    'O4': '文化素養'
}

# 博雅通識子分類對應表
GENERAL_SUBCATEGORY_MAPPING = {
    'LI': '人文科學類',
    'SO': '社會科學類',
    'SC': '自然科學類'
}